<a href="https://colab.research.google.com/github/isadora-yasmim/Data-science-studies-n-practice/blob/main/Aula_1_Imersao_Alura_Dados_com_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [22]:
#importa a base dados
base = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [23]:
#retorna as 5 primeiras linhas da base de dados, por padrão. caso queiramos mais linhas basta especificar base.head(num de linhas desejadas)
base.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [24]:
#retorna as colunas, os tipos, o range e a meoria usada
base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [25]:
#retorna infos de estatistica descritiva sobre os dados numerico da base de dados(count= numero total, mean= media, std= desvio padrao, min= minimo, max= maximo, 25%, 50% e 75%)
base.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [26]:
# shape= atributo que descreve a dimensao do arquivo tuplas x colunas
base.shape

(133349, 11)

In [27]:
# defino o valor das variaveis linhas e colunas como o valor de base.shape nas posicoes 0 e 1 respectivamente
linhas, colunas = base.shape[0], base.shape[1]
print('Numero de linhas:', linhas)
print('Numero de colunas:', colunas)

Numero de linhas: 133349
Numero de colunas: 11

In [28]:
#columns= atributo que lista os nomes das colunas
base.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [29]:
# dicionario com o nome da coluna em ingles e sua respectiva traducao
mapeamento_colunas = {
    'work_year': 'ano',
    'experience_level': 'nivel_experiencia',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}

# rename= metodo que vai renomear, neste caso, as colunas da nossa base
base = base.rename(columns=mapeamento_colunas)

print("Colunas traduzidas com sucesso!")
print(base.columns)

Colunas traduzidas com sucesso!
Index(['ano', 'nivel_experiencia', 'contrato', 'cargo', 'salario', 'moeda',
       'usd', 'residencia', 'remoto', 'empresa', 'tamanho_empresa'],
      dtype='object')

In [18]:
#value_counts()= metodo que retorna a frequencia dos dados em uma coluna especifica
base['nivel_experiencia'].value_counts()
#SE- senior, MI- pleno, EN- junior e EX- C level

nivel_experiencia
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [30]:
base['contrato'].value_counts()
#FT- full time , CT- contrato temporario, PT- part time , FL- freelance

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [34]:
base['tamanho_empresa'].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [31]:
base['remoto'].value_counts()
#0- presencial, 100- remoto e 50- hibrido

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [33]:
#dicionario com o nome atual e o nome desejado das categorias
map_nivel_experiencia = {
    'SE': 'Senior',
    'MI': 'Pleno' ,
    'EN':' Junior',
    'EX':' C level'
}

#substituimos os nomes das categorias
base['nivel_experiencia'] = base['nivel_experiencia'].replace(map_nivel_experiencia)
print("Categorias de nivel_experiencia renomeadas com sucesso!")
base['nivel_experiencia'].value_counts()

Categorias de nivel_experiencia renomeadas com sucesso!

nivel_experiencia
Senior      77241
Pleno       40465
 Junior     12443
 C level     3200
Name: count, dtype: int64

In [35]:
map_contrato = {
    'FT': 'Tempo Integral',
    'CT': 'Contrato Temporário',
    'PT': 'Meio Período',
    'FL': 'Freelancer'
}

base['contrato'] = base['contrato'].replace(map_contrato)
print("Categorias de contrato renomeadas com sucesso!")
base['contrato'].value_counts()

Categorias de contrato renomeadas com sucesso!

contrato
Tempo Integral         132563
Contrato Temporário       394
Meio Período              376
Freelancer                 16
Name: count, dtype: int64

In [36]:
map_tamanho_empresa = {
    'M': 'Média',
    'L': 'Grande',
    'S': 'Pequena'
}

base['tamanho_empresa'] = base['tamanho_empresa'].replace(map_tamanho_empresa)
print("Categorias de tamanho_empresa renomeadas com sucesso!")
base['tamanho_empresa'].value_counts()

Categorias de tamanho_empresa renomeadas com sucesso!

tamanho_empresa
Média      129561
Grande       3574
Pequena       214
Name: count, dtype: int64

In [37]:
map_remoto = {
    0: 'Presencial',
    100: 'Remoto',
    50: 'Híbrido'
}

base['remoto'] = base['remoto'].replace(map_remoto)
print("Categorias de remoto renomeadas com sucesso!")
base['remoto'].value_counts()

Categorias de remoto renomeadas com sucesso!

remoto
Presencial    105312
Remoto         27718
Híbrido          319
Name: count, dtype: int64

In [38]:
base.head()

,ano,nivel_experiencia,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [39]:
#retorna infos de estatistica descritiva sobre os dados gerais da base(count= numero total, unique= quantos valores diferentes existem, top= valor mais repetido e freq= frequencia do valor mais repetido)
base.describe(include= "object")

,nivel_experiencia,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Média
freq,77241,132563,17314,126140,119579,105312,119641,129561